'''Домашнее задание по теме "Многопроцессное программирование"
Цель: понять разницу между линейным и многопроцессным подходом, выполнив операции обоими способами.

Задача "Многопроцессное считывание":
Необходимо считать информацию из нескольких файлов одновременно, используя многопроцессный подход.
Подготовка:
Скачайте архив с файлами для считывания данных и распакуйте его в проект для дальнейшего использования.
Выполнение:
Создайте функцию read_info(name), где name - название файла. Функция должна:
Создавать локальный список all_data.
Открывать файл name для чтения.
Считывать информацию построчно (readline), пока считанная строка не окажется пустой.
Во время считывания добавлять каждую строку в список all_data.
Этих операций достаточно, чтобы рассмотреть преимущество многопроцессного выполнения программы над линейным.
Создайте список названий файлов в соответствии с названиями файлов архива.
Вызовите функцию read_info для каждого файла по очереди (линейно) и измерьте время выполнения и выведите его в консоль.
Вызовите функцию read_info для каждого файла, используя многопроцессный подход: контекстный менеджер with и объект Pool. Для вызова функции используйте метод map, передав в него функцию read_info и список названий файлов. Измерьте время выполнения и выведите его в консоль.
Для избежания некорректного вывода запускайте линейный вызов и многопроцессный по отдельности, предварительно закомментировав другой.

Пример результата выполнения программы:
Выполняемый код:
def read_info(name):
...
filenames = [f'./file {number}.txt' for number in range(1, 5)]

# Линейный вызов

# Многопроцессный

Вывод на консоль, 2 запуска (результаты могут отличаться):
0:00:03.046163 (линейный)
0:00:01.092300 (многопроцессный)

Примечания:
Используйте конструкцию if __name__ == '__main__' при многопроссном подходе.
Выводить или возвращать список all_data в функции не нужно. Можете сделать это, но кол-во информации в файлах достигает - 10^9 строк.'''

import multiprocessing
import datetime

def read_info(name):
    all_data = []
    file = open(name, 'r')
    while True:
        line = file.readline()
        if not line:
            break
        all_data.append(line)

files = [f'./Files/file {i}.txt'for i in range(1, 5)]

'''Линейный вызов'''
# start = datetime.datetime.now()
# for i in files:
#     read_info(i)
# end = datetime.datetime.now()
# print(end - start)


'''Многопроцессный вызов'''
if __name__ == '__main__':
    with multiprocessing.Pool(processes=4) as pool:
            start = datetime.datetime.now()
            pool.map(read_info, files)
    end = datetime.datetime.now()
    print(end - start)

'''Результаты выполнения
0:00:04.664965 (линейный)
0:00:01.725983 (многопроцессный)'''